# CheckAllFamiliesSlow Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LoadedFamilyIntegrityCheck..::..CheckAllFamiliesSlow Method
LoadedFamilyIntegrityCheck Class See Also
---
Check integrity of content documents of all families loaded in the host document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool CheckAllFamiliesSlow(
	Document ADoc,
	ISet<ElementId> corruptFamilyIds
)
```

Visual Basic
---
```text
Public Shared Function CheckAllFamiliesSlow ( _
	ADoc As Document, _
	corruptFamilyIds As ISet(Of ElementId) _
) As Boolean
```

Visual C++
---
```text
public:
static bool CheckAllFamiliesSlow(
	Document^ ADoc,
	ISet<ElementId^>^ corruptFamilyIds
)
```

# ### Parameters
ADoc
    Type: Autodesk.Revit.DB..::..Document The host document.
corruptFamilyIds
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)> Return ids of families that need to be reloaded because their content documents are missing or corrupt.
# ### Return Value
Returns true if all content documents are usable.
# Remarks
This check is slow as it invloves traversal of all content documents. It also dumps data about bad families into the journal, as well as the whole content tree into the dump file.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LoadedFamilyIntegrityCheck Class
Autodesk.Revit.DB Namespace